yc-adi/msdk_open/Examples/MAX32655/BLE_cgm/main.c
/*************************************************************************************************/
/*!
*  \file   main.c
*
*  \brief  Main file for CGM application.
*
*  Copyright (c) 2013-2019 Arm Ltd. All Rights Reserved.
*
*  Copyright (c) 2019 Packetcraft, Inc.
*
*  Partial Copyright (c) 2023 Analog Devices, Inc.
*
*  Licensed under the Apache License, Version 2.0 (the "License");
*  you may not use this file except in compliance with the License.
*  You may obtain a copy of the License at
*
*      http://www.apache.org/licenses/LICENSE-2.0
*
*  Unless required by applicable law or agreed to in writing, software
*  distributed under the License is distributed on an "AS IS" BASIS,
*  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
*  See the License for the specific language governing permissions and
*  limitations under the License.
*/
/*************************************************************************************************/

#include <string.h>
#include "wsf_types.h"
#include "wsf_trace.h"
#include "wsf_bufio.h"
#include "wsf_msg.h"
#include "wsf_assert.h"
#include "wsf_buf.h"
#include "wsf_heap.h"
#include "wsf_cs.h"
#include "wsf_timer.h"
#include "wsf_os.h"

#include "sec_api.h"
#include "hci_handler.h"
#include "dm_handler.h"
#include "l2c_handler.h"
#include "att_handler.h"
#include "smp_handler.h"
#include "l2c_api.h"
#include "att_api.h"
#include "smp_api.h"
#include "app_api.h"
#include "hci_core.h"
#include "app_terminal.h"
#include "wut.h"
#include "rtc.h"
#include "trimsir_regs.h"
#include "mxc_delay.h"
#include "nvic_table.h"

#if defined(HCI_TR_EXACTLE) && (HCI_TR_EXACTLE == 1)
#include "ll_init_api.h"
#endif

#include "pal_bb.h"
#include "pal_bb_ble.h"
#include "pal_cfg.h"

#include "cgm_api.h"
#include "app_ui.h"

#include "board.h"
#include "led.h"
#include "max32655.h"
#include "mxc_delay.h"
#include "nvic_table.h"
#include "pal_btn.h"
#include "pal_i2s.h"
#include "pal_led.h"
#include "pal_uart.h"
#include "pal_timer.h"
#include "led.h"
#include "spi.h"
#include "uart.h"

/**************************************************************************************************
  Macros
**************************************************************************************************/
#define USE_RTC         1
#define SPI_SLAVE_RX    0

/*! \brief UART TX buffer size */
#define PLATFORM_UART_TERMINAL_BUFFER_SIZE (1024U*1)

/*! \brief SPI */
#define PLATFORM_SPI_BUF_SIZE   (2)
#define DATA_LEN        2
#define DATA_SIZE       16
#define SPI_SPEED       100000 // Bit Rate

#define SPI             MXC_SPI0
#define SPI_IRQ         SPI0_IRQn

#define DEFAULT_TX_POWER 0 /* dBm */

#define SPI_BUF_LEN     2
#define SPI_DATA_SIZE   16
#define SPI_SPEED       100000 // Bit Rate

#define SPI             MXC_SPI0
#define SPI_IRQ         SPI0_IRQn

#define SECS_PER_MIN 60
#define SECS_PER_HR (60 * SECS_PER_MIN)
#define SECS_PER_DAY (24 * SECS_PER_HR)

/**************************************************************************************************
  Global Variables
**************************************************************************************************/
typedef struct
{
  wsfEventHandler_t     handler[WSF_MAX_HANDLERS];
  wsfEventMask_t        handlerEventMask[WSF_MAX_HANDLERS];
  wsfQueue_t            msgQueue;
  wsfTaskEvent_t        taskEventMask;
  uint8_t               numHandler;
} wsfOsTask_t;

/*! \brief  OS structure */
typedef struct
{
  wsfOsTask_t                 task;
  WsfOsIdleCheckFunc_t        sleepCheckFuncs[WSF_OS_MAX_SERVICE_FUNCTIONS];
  uint8_t                     numFunc;
} wsfOs_t;

extern wsfOs_t wsfOs;

/*! \brief  Pool runtime configuration. */
static wsfBufPoolDesc_t mainPoolDesc[] = { { 16, 8 }, { 32, 4 }, { 192, 8 }, { 256, 16 } };

#if defined(HCI_TR_EXACTLE) && (HCI_TR_EXACTLE == 1)
static LlRtCfg_t mainLlRtCfg;
#endif

volatile int wutTrimComplete;

#define MAX_DS_WUT_TICKS        (32768)     /* Maximum deep sleep time, units of 32 kHz ticks */
#define MIN_DS_WUT_TICKS        (100)       /* Minimum deep sleep time, units of 32 kHz ticks (1/32768*100=3 ms) */

#define WAKEUP_US               (750)       /* Deep sleep recovery time, units of us */
#define WAKEUP_IN_WUT_TICK      ((uint64_t)WAKEUP_US * (uint64_t)32768 / (uint64_t)1000000)

#define RESTORE_OP_IN_WUT_TICK  (3)
#define RESTORE_OP_IN_US        ((uint64_t)RESTORE_OP_IN_WUT_TICK * (uint64_t)1000000 / (uint64_t)32768)

#define WUT_FREQ                (32768)
#define US_TO_WUTTICKS(x)       (((x) * WUT_FREQ) / 1000000)
#define WUT_MIN_TICKS           (10)

#define SLEEP_LED               (1)
#define DEEPSLEEP_LED           (0)

extern uint8_t conn_opened;
uint32_t u32DeepSleepNdx = 0;
uint32_t u32LastDeepSleepCnt = 0;

uint16_t spi_rx_data[SPI_BUF_LEN];
mxc_spi_req_t spi_req;
/** @brief spi rx state
 * 0: idle
 * 1: after call async to receive and before receive all data
 * 2: after receive desired data
 */
int spiRxReady = 0;

extern bool_t ChciTrService(void);

/**************************************************************************************************
  Functions
**************************************************************************************************/
void printTime(void)
{
    int day, hr, min, err;
    uint32_t sec, rtc_readout;
    double subsec;

    do {
        err = MXC_RTC_GetSubSeconds(&rtc_readout);
    } while (err != E_NO_ERROR);
    subsec = rtc_readout / 4096.0;

    do {
        err = MXC_RTC_GetSeconds(&rtc_readout);
    } while (err != E_NO_ERROR);
    sec = rtc_readout;

    day = sec / SECS_PER_DAY;
    sec -= day * SECS_PER_DAY;

    hr = sec / SECS_PER_HR;
    sec -= hr * SECS_PER_HR;

    min = sec / SECS_PER_MIN;
    sec -= min * SECS_PER_MIN;

    subsec += sec;

    APP_TRACE_INFO4("Uptime: DAY %d, %02d:%02d:%02d\n", day, hr, min, (uint32_t)subsec);
}

void InitRtc(void)
{
    if (MXC_RTC_Init(0, 0) != E_NO_ERROR) {
        printf("Failed RTC Initialization\n");
        printf("Example Failed\n");

        while (1) {}
    }

    if (MXC_RTC_Start() != E_NO_ERROR) {
        printf("Failed RTC_Start\n");
        printf("Example Failed\n");

        while (1) {}
    }

    printf("RTC started\n");
    MXC_Delay(10);
}

void SPI_IRQHandler(void)
{
    MXC_SPI_AsyncHandler(SPI);

    spiRxReady = 2;
}

#if DEEP_SLEEP == 1
extern wsfTimerTicks_t wsfTimerNextExpiration(void);
extern uint32_t wsfTimerTicksToRtc(wsfTimerTicks_t wsfTicks);
extern void MXC_LP_EnableWUTAlarmWakeup(void);
extern bool_t PalSysIsBusy(void);
extern void MXC_LP_EnterStandbyMode(void);
#endif  

#if DEEP_SLEEP == 1

/*************************************************************************************************/
extern void *AsyncTxRequests[MXC_UART_INSTANCES];
extern void *AsyncRxRequests[MXC_UART_INSTANCES];

int DeepSleep(void)
{
    volatile uint32_t preCaptureInWutCnt;
    uint32_t schUsec;
    uint32_t dsInWutCnt, dsWutTicks;
    uint64_t bleSleepTicks, idleInWutCnt, schUsecElapsed; //dsSysTickPeriods, ;
    bool_t schTimerActive;
    volatile uint32_t wutCnt;

    /* If PAL system is busy, no need to sleep. */
    if (PalSysIsBusy())
    {
        return 1;
    }

    if (wsfOs.task.taskEventMask != 0)
    {
        return 2;
    }

    // MXC_UART_ReadyForSleep(MXC_UART_GET_UART(CONSOLE_UART)) == E_NO_ERROR
    if (AsyncTxRequests[CONSOLE_UART] != NULL) {
        return 3;
    }
    
    uint32_t wsfTicksToNextExpiration = wsfTimerNextExpiration();
    if (wsfTicksToNextExpiration > 0)
    {
        idleInWutCnt = wsfTimerTicksToRtc(wsfTicksToNextExpiration);
    }
    else
    {
        idleInWutCnt = 0;
    }

    if (idleInWutCnt > MAX_DS_WUT_TICKS) {
        idleInWutCnt = MAX_DS_WUT_TICKS;
    }

    /* Check to see if we meet the minimum requirements for deep sleep */
    if (idleInWutCnt < (MIN_DS_WUT_TICKS + WAKEUP_IN_WUT_TICK)) {
        return 4;
    }

    WsfTaskLock();
    /** Enter a critical section but don't use the taskENTER_CRITICAL()
     *  method as that will mask interrupts that should exit sleep mode. 
     */
    __asm volatile("cpsid i");

    /* Determine if the Bluetooth scheduler is running */
    if (PalTimerGetState() == PAL_TIMER_STATE_BUSY)
    {
        schTimerActive = TRUE;
    }
    else
    {
        schTimerActive = FALSE;
    }

    if (!schTimerActive) {
        uint32_t ts;
        if (PalBbGetTimestamp(&ts)) {
            /*Determine if PalBb is active, return if we get a valid time stamp indicating 
             * that the scheduler is waiting for a PalBb event */
            goto EXIT_SLEEP_FUNC;
        }
    }

    /* Adjust idleTicks for the time it takes to restart the BLE hardware */
    if (idleInWutCnt > (WAKEUP_IN_WUT_TICK + RESTORE_OP_IN_WUT_TICK))
    {
        idleInWutCnt-= (WAKEUP_IN_WUT_TICK + RESTORE_OP_IN_WUT_TICK);
    }
    else
    {
        idleInWutCnt = 0;
    }
    
    /* Disable SysTick */
    SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk);

    /* Enable wakeup from WUT */
    NVIC_EnableIRQ(WUT_IRQn);
    MXC_LP_EnableWUTAlarmWakeup();

    /* Determine if we need to snapshot the PalBb clock */
    /* Snapshot the current WUT value with the PalBb clock */
    MXC_WUT_Store(MXC_WUT);
    preCaptureInWutCnt = MXC_WUT_GetCount(MXC_WUT);
    if (schTimerActive) 
    {
        schUsec = PalTimerGetExpTime();  // old way: bool_t SchBleGetNextDueTime(uint32_t *pDueTime)
        
        /* Calculate the time to the next BLE scheduler event */
        if (schUsec < (WAKEUP_US + RESTORE_OP_IN_US))
        {
            bleSleepTicks = 0;
        }
        else
        {
            bleSleepTicks = ((uint64_t)schUsec - (uint64_t)WAKEUP_US - (uint64_t)RESTORE_OP_IN_US) *
                            (uint64_t)32768 / (uint64_t)BB_CLK_RATE_HZ;
        }
    } 
    else
    {
        schUsec = 0;
        bleSleepTicks = 0;
    }

    /* Sleep for the shortest tick duration */
    if (schTimerActive && (bleSleepTicks < idleInWutCnt))
    {
        dsInWutCnt = bleSleepTicks;
    } 
    else
    {
        dsInWutCnt = idleInWutCnt;
    }

    /**
     * In WUT one-shot mode, the timer peripheral increments the WUTn_CNT.count field 
     * until it matches the WUTn_CMP.compare field and then stops incrementing and 
     * disables the timer.
    */

    /* Only enter deep sleep if we have enough time */
    if (dsInWutCnt >= MIN_DS_WUT_TICKS) {
        if (dsInWutCnt > MAX_DS_WUT_TICKS) {
            dsInWutCnt = MAX_DS_WUT_TICKS;
        }

        /*
        u64WutCmpVal = (uint64_t)preCaptureInWutCnt + (uint64_t)dsInWutCnt;
        if (u64WutCmpVal > 0xFFFFFFFF) {
            u64WutCmpVal = 0xFFFFFFFF - preCaptureInWutCnt;
        }
        */
        /* Arm the WUT interrupt */
        MXC_WUT->cmp = preCaptureInWutCnt + dsInWutCnt;
        
        if (schTimerActive)
        {
            /* Stop the BLE scheduler timer */
            PalTimerStop();

            /* Shutdown BB hardware */
            PalBbDisable();
        }

        LED_Off(SLEEP_LED);
        LED_Off(DEEPSLEEP_LED);

        MXC_LP_EnterStandbyMode();

        LED_On(DEEPSLEEP_LED);
        LED_On(SLEEP_LED);

        if (schTimerActive)
        {
            /* Enable and restore the BB hardware */
            PalBbEnable();

            PalBbRestore();

            /* Restore the BB counter */
            MXC_WUT_RestoreBBClock(MXC_WUT, BB_CLK_RATE_HZ);

            if (conn_opened)
            {
                PalBbBleRefreshKeyAfterSleep();
            }

            /* Restart the BLE scheduler timer */
            wutCnt = MXC_WUT_GetCount(MXC_WUT);
            if (wutCnt >= preCaptureInWutCnt)
            {
                dsWutTicks = wutCnt - preCaptureInWutCnt;
            }
            else
            {
                dsWutTicks = 0xFFFFFFFF - preCaptureInWutCnt + wutCnt;
            }

            schUsecElapsed = (uint64_t)dsWutTicks * (uint64_t)1000000 / (uint64_t)32768;

            int palTimerStartTicks = schUsec - schUsecElapsed;
            if (palTimerStartTicks < 1) {
                palTimerStartTicks = 1;
            }
            PalTimerStart(palTimerStartTicks);
        }
    }

    /* Re-enable SysTick */
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;                               /* if(not busy) */

EXIT_SLEEP_FUNC:
    /* Re-enable interrupts - see comments above */
    __asm volatile("cpsie i");

    WsfTaskUnlock();

    return 0;
}
#endif /* DEEP_SLEEP */

/*! \brief  Stack initialization for app. */
extern void StackInitCgm(void);

/*************************************************************************************************/
/*!
 *  \brief  Initialize WSF.
 *
 *  \return None.
 */
/*************************************************************************************************/
static int mainWsfInit(void)
{
#if defined(HCI_TR_EXACTLE) && (HCI_TR_EXACTLE == 1)
    /* +12 for message headroom, + 2 event header, +255 maximum parameter length. */
    const uint16_t maxRptBufSize = 12 + 2 + 255;

    /* +12 for message headroom, +4 for header. */
    const uint16_t aclBufSize = 12 + mainLlRtCfg.maxAclLen + 4 + BB_DATA_PDU_TAILROOM;
    (void)aclBufSize;
    
    /* Adjust buffer allocation based on platform configuration. */
    mainPoolDesc[2].len = maxRptBufSize;
    mainPoolDesc[2].num = mainLlRtCfg.maxAdvReports;
    mainPoolDesc[3].len = 400;  // aclBufSize; TODO: adjust based on need
    mainPoolDesc[3].num = mainLlRtCfg.numTxBufs + mainLlRtCfg.numRxBufs;
#endif

    const uint8_t numPools = sizeof(mainPoolDesc) / sizeof(mainPoolDesc[0]);

    uint16_t memUsed;
    WsfCsEnter();
    memUsed = WsfBufInit(numPools, mainPoolDesc);
    WsfHeapAlloc(memUsed);
    WsfCsExit();

    WsfOsInit();

    WsfTimerInit();

#if (WSF_TOKEN_ENABLED == TRUE) || (WSF_TRACE_ENABLED == TRUE)

    WsfCsEnter();
    memUsed = WsfBufIoUartInit(WsfHeapGetFreeStartAddress(), PLATFORM_UART_TERMINAL_BUFFER_SIZE);
    WsfHeapAlloc(memUsed);
    WsfCsExit();

    WsfTraceRegisterHandler(WsfBufIoWrite);
    WsfTraceEnable(TRUE);

    AppTerminalInit();
    //MXC_Delay(100000);
#endif
    return 0;
}

/*************************************************************************************************/
/*!
*  \fn     WUT_IRQHandler
*
*  \brief  WUY interrupt handler.
*
*  \return None.
*/
/*************************************************************************************************/
void WUT_IRQHandler(void)
{
    MXC_WUT_Handler(MXC_WUT0);
}

/*************************************************************************************************/
/*!
*  \fn     wutTrimCb
*
*  \brief  Callback function for the WUT 32 kHz crystal trim.
*
*  \param  err    Error code from the WUT driver.
*
*  \return None.
*/
/*************************************************************************************************/
void wutTrimCb(int err)
{
    if (err != E_NO_ERROR) {
        APP_TRACE_INFO1("32 kHz trim error %d\n", err);
    } else {
        APP_TRACE_INFO1("32kHz trimmed to 0x%x", (MXC_TRIMSIR->rtc & MXC_F_TRIMSIR_RTC_X1TRIM) >>
                                                     MXC_F_TRIMSIR_RTC_X1TRIM_POS);
    }
    wutTrimComplete = 1;
}

/*************************************************************************************************/
/*!
*  \fn     setAdvTxPower
*
*  \brief  Set the default advertising TX power.
*
*  \return None.
*/
/*************************************************************************************************/
void setAdvTxPower(void)
{
    LlSetAdvTxPower(DEFAULT_TX_POWER);
}

/*************************************************************************************************/
/*!
*  \fn     main
*
*  \brief  Entry point for demo software.
*
*  \param  None.
*
*  \return None.
*/
/*************************************************************************************************/
int main(void)
{
#if DEEP_SLEEP == 1
    printf("\n\n***** MAX32665 BLE CGM, Deep Sleep Version *****\n");
#else
    printf("\n\n***** MAX32665 BLE CGM, Non Deep Sleep Version *****\n");
#endif
    printf("SystemCoreClock = %d MHz\n\n", SystemCoreClock/1000000);
    MXC_Delay(10000);


    // in order to get clean VDDIO
    MXC_GPIO0->inen = 0x0;
    MXC_GPIO1->inen = 0x0;
    MXC_GPIO2->inen = 0x0;
    MXC_GPIO3->inen = 0x0;

#if 1
    mxc_gpio_cfg_t lpGpio;
    /* Set the wakeup pins high */
    lpGpio.port = MXC_GPIO3;
    lpGpio.mask = (0x3);
    lpGpio.func = MXC_GPIO_FUNC_OUT;
    lpGpio.pad = MXC_GPIO_PAD_NONE;
    lpGpio.vssel = MXC_GPIO_VSSEL_VDDIO;
    MXC_GPIO_Config(&lpGpio);
    MXC_GPIO_OutSet(MXC_GPIO3, 0x3);
#endif

    uint32_t memUsed;

#if USE_RTC == 1
    InitRtc();
#endif

#if SPI_SLAVE_RX == 1
    int spiInitRet;

    /// Init SPI Slave
    mxc_spi_pins_t spi_pins;

    spi_pins.clock = true;
    spi_pins.miso = true;
    spi_pins.mosi = true;
    spi_pins.ss0 = true;
    spi_pins.ss1 = false;
    spi_pins.ss2 = false;
    spi_pins.sdio2 = false;
    spi_pins.sdio3 = false;
    spi_pins.vddioh = false;

    printf("SPI slave rx init\n");
    spiInitRet = MXC_SPI_Init(SPI, // spi regiseter
                          0, // master mode
                          0, // quad mode
                          1, // num slaves
                          1, // ss polarity
                          SPI_SPEED,
                          spi_pins);
    if (spiInitRet != E_NO_ERROR) {
        printf("SPI INITIALIZATION ERROR\n");
    }

    if (spiInitRet == E_NO_ERROR)
    {
        spiInitRet = MXC_SPI_SetDataSize(SPI, SPI_DATA_SIZE);
        if (spiInitRet != E_NO_ERROR) {
            MXC_SPI_Shutdown(SPI);
            
            printf("SPI SET DATASIZE ERROR: %d\n", spiInitRet);
        }
    }

    if (spiInitRet == E_NO_ERROR)
    {
        spiInitRet = MXC_SPI_SetWidth(SPI, SPI_WIDTH_STANDARD);
        if (spiInitRet != E_NO_ERROR) {
            printf("\nSPI SET WIDTH ERROR: %d\n", spiInitRet);
        }
    }

    if (spiInitRet == E_NO_ERROR)
    {
        // SPI Request
        spi_req.spi = SPI;
        spi_req.txData = NULL;
        spi_req.rxData = (uint8_t *)spi_rx_data;
        spi_req.txLen = 0;
        spi_req.rxLen = SPI_BUF_LEN;
        spi_req.ssIdx = 0;
        spi_req.ssDeassert = 1;
        spi_req.txCnt = 0;
        spi_req.rxCnt = 0;
        spi_req.completeCB = NULL;

        MXC_NVIC_SetVector(SPI_IRQ, SPI_IRQHandler);
        NVIC_EnableIRQ(SPI_IRQ);

        memset(spi_rx_data, 0x0, SPI_BUF_LEN * sizeof(uint16_t));
    }

    MXC_Delay(1000);
#endif

#if defined(HCI_TR_EXACTLE) && (HCI_TR_EXACTLE == 1)
    /* Configurations must be persistent. */
    static BbRtCfg_t mainBbRtCfg;

    PalBbLoadCfg((PalBbCfg_t *)&mainBbRtCfg);
    LlGetDefaultRunTimeCfg(&mainLlRtCfg);

#if (BT_VER >= LL_VER_BT_CORE_SPEC_5_0)
    /* Set 5.0 requirements. */
    mainLlRtCfg.btVer = LL_VER_BT_CORE_SPEC_5_0;
#endif

    PalCfgLoadData(PAL_CFG_ID_LL_PARAM, &mainLlRtCfg.maxAdvSets, sizeof(LlRtCfg_t) - 9);

#if (BT_VER >= LL_VER_BT_CORE_SPEC_5_0)
    PalCfgLoadData(PAL_CFG_ID_BLE_PHY, &mainLlRtCfg.phy2mSup, 4);
#endif

    /* Set the 32k sleep clock accuracy into one of the following bins, default is 20
      HCI_CLOCK_500PPM
      HCI_CLOCK_250PPM
      HCI_CLOCK_150PPM
      HCI_CLOCK_100PPM
      HCI_CLOCK_75PPM
      HCI_CLOCK_50PPM
      HCI_CLOCK_30PPM
      HCI_CLOCK_20PPM
    */
    mainBbRtCfg.clkPpm = 20;

    /* Set the default connection power level */
    mainLlRtCfg.defTxPwrLvl = DEFAULT_TX_POWER;
#endif
    
    mainWsfInit();

#if defined(HCI_TR_EXACTLE) && (HCI_TR_EXACTLE == 1)
    WsfCsEnter();
    LlInitRtCfg_t llCfg = { .pBbRtCfg = &mainBbRtCfg,
                            .wlSizeCfg = 4,
                            .rlSizeCfg = 4,
                            .plSizeCfg = 4,
                            .pLlRtCfg = &mainLlRtCfg,
                            .pFreeMem = WsfHeapGetFreeStartAddress(),
                            .freeMemAvail = WsfHeapCountAvailable() };

    memUsed = LlInit(&llCfg);
    WsfHeapAlloc(memUsed);
    WsfCsExit();

    bdAddr_t bdAddr;
    PalCfgLoadData(PAL_CFG_ID_BD_ADDR, bdAddr, sizeof(bdAddr_t));
    LlSetBdAddr((uint8_t *)&bdAddr);

    /* Start the 32 MHz crystal and the BLE DBB counter to trim the 32 kHz crystal */
    PalBbEnable();

    /* Output buffered square wave of 32 kHz clock to GPIO */
    // MXC_RTC_SquareWaveStart(MXC_RTC_F_32KHZ);

    /* Execute the trim procedure */
    wutTrimComplete = 0;
    MXC_WUT_TrimCrystalAsync(MXC_WUT0, wutTrimCb);
    while (!wutTrimComplete) {}

    /* Stop here to measure the 32 kHz clock */
    /* while(1) {} */
    MXC_RTC_SquareWaveStop();

    /* Shutdown the 32 MHz crystal and the BLE DBB */
    PalBbDisable();
#endif

    StackInitCgm();

    CgmStart();
    printf("SystemCoreClock = %d MHz\n\n", SystemCoreClock/1000000);
    // WsfOsEnterMainLoop();
    while(TRUE)
    {
        WsfTimerSleepUpdate();

        wsfOsDispatcher();

        if (wsfOs.numFunc == 0 || !WsfOsActive())
        {
            #if  DEEP_SLEEP == 1
            DeepSleep();
            //WsfTimerSleep();
            #else
            WsfTimerSleep();
#endif
        }
        if (u32DeepSleepNdx == 1)
        {
            APP_TRACE_INFO2("%d %d", u32LastDeepSleepCnt, u32DeepSleepNdx);
            u32DeepSleepNdx = 0;
        }
    }

    /* Does not return. Should never be reached here. */
    return 0;
}
